RIET/src/DataProcessors/rgsУдалитьМониторСопровождения/rgsУдалитьМониторСопровождения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>rgsУдалитьМониторСопровождения</name>
  <comment>Обрабокта подключения к Монитору сопровождения (начиная с версии 3.0.2.2) через веб-сервисы</comment>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Пароль</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресБазы</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗагружатьЗакрытыеОтмененныеВопросы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВремяОбновления</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбновлятьАвтоматически</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Проект</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ГУИДТекПользователя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>40</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяТекПользователя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОтображатьТекстВопросаСЗадержкой</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВремяОбновленияТекстаВопроса</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:DataProcessor>

RIET/src/DataProcessors/rgsУдалитьМониторСопровождения/Forms/ФормаНастройки/Module.bsl
&НаСервере
// Процедура - обработчик события "ПриСозданииНаСервере" формы
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Объект.Пользователь = Параметры.Пользователь;
	Объект.Пароль		= Параметры.Пароль;
	Объект.АдресБазы 	= Параметры.АдресБазы;
	Объект.ЗагружатьЗакрытыеОтмененныеВопросы 	= Параметры.ЗагружатьЗакрытыеОтмененныеВопросы;
	Объект.ОбновлятьАвтоматически 				= Параметры.ОбновлятьАвтоматически;
	Объект.ВремяОбновления 						= Параметры.ВремяОбновления;
	Объект.ОтображатьТекстВопросаСЗадержкой 	= Параметры.ОтображатьТекстВопросаСЗадержкой;
	Объект.ВремяОбновленияТекстаВопроса 		= Параметры.ВремяОбновленияТекстаВопроса;

	Элементы.ВремяОбновления.Доступность = Объект.ОбновлятьАвтоматически;
    Элементы.ВремяОбновленияТекстаВопроса.Доступность = Объект.ОтображатьТекстВопросаСЗадержкой;
  
КонецПроцедуры

&НаКлиенте
// Процедура формирует структуру настроек
//
Процедура ОК(Команда)
	
	Структура = Новый Структура;
	Структура.Вставить("Пользователь",	Объект.Пользователь);
	Структура.Вставить("Пароль", 		Объект.Пароль);
    Структура.Вставить("АдресБазы",		Объект.АдресБазы);
	Структура.Вставить("ЗагружатьЗакрытыеОтмененныеВопросы", Объект.ЗагружатьЗакрытыеОтмененныеВопросы);
    Структура.Вставить("ВремяОбновления",					 Объект.ВремяОбновления);
    Структура.Вставить("ОбновлятьАвтоматически",			 Объект.ОбновлятьАвтоматически);
	Структура.Вставить("ОтображатьТекстВопросаСЗадержкой",	 Объект.ОтображатьТекстВопросаСЗадержкой);
    Структура.Вставить("ВремяОбновленияТекстаВопроса",		 Объект.ВремяОбновленияТекстаВопроса);

	Закрыть(Структура);

КонецПроцедуры

&НаКлиенте
Процедура ОбновлятьАвтоматическиПриИзменении(Элемент)
	
	Элементы.ВремяОбновления.Доступность = Объект.ОбновлятьАвтоматически;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтображатьТекстВопросаСЗадержкойПриИзменении(Элемент)
	
	Элементы.ВремяОбновленияТекстаВопроса.Доступность = Объект.ОтображатьТекстВопросаСЗадержкой;

КонецПроцедуры
